{
  "author": {
    "name": "Gus Mueller"
  },
  "description": "News from your friends at Flying Meat.",
  "feed_url": "http://flyingmeat.com/blog/feed.json",
  "home_page_url": "http://flyingmeat.com/blog/",
  "items": [
    {
      "content_html": "<p><a href=\"http://flyingmeat.com/acorn/\">Acorn 5 is out now</a>, and it even comes with a 14 day trial so you have no excuse not to try it.</p>\n<p>We worked hard on it, and we think it&#39;s pretty awesome.  We&#39;re biased of course, and you can check the <a href=\"http://flyingmeat.com/acorn/releasenotes.html\">release notes</a> for the full details, but here are three of my favorite new features:</p>\n<p><strong>New Thing</strong>: The Shape Processor.  It&#39;s a collection of non destructive filters that  work on vector shapes instead of pixels.</p>\n<center><img src=\"http://shapeof.com/2015/8/flower.jpeg\" alt=\"flower\" /></center>\n\n<p>In the example above we start with the white shape on the left, and then combining four filters together to make the flower on the right.  Here&#39;s what the settings look like:</p>\n<center><img src=\"http://shapeof.com/2015/8/flower-proc.png\" alt=\"flower\" width=\"334\" /></center>\n\n<p>If this looks a lot like the filter that Acorn already has… well, that&#39;s on purpose.  Shape processors are of course non-destructive and save along with Acorn&#39;s native file format.  So you can save your image, open it back up, and tweak the settings as you&#39;d like.  You can make some really fun stuff with it and it turns out to be super useful for lots of things.</p>\n<p><strong>New Filters</strong>: Curves and Levels.  But wait - Acorn already has Curves and Levels, right?  Yes, but in Acorn 5 they are baked into the existing filter chain.  So now you can add Levels to your Curves and then a blur and then why not add Curves again after that and finish with a Drop Shadow filter?  Then save the file and open it upagain and remove the second Curves because that&#39;s just too much what were you thinking? And then you realize Curves and Levels are now non-destructive and that&#39;s amazing.</p>\n<p>Boom.</p>\n<p><strong>Hundreds of Little Things</strong>: We fixed hundreds of minor bugs and annoyances.  Little things that built up over the years that very few people ever encountered, like &quot;the shortcut key for zooming in doesn&#39;t work when the keyboard layout is set to Dvorak - Qwerty ⌘&quot;.  So we fixed pretty much all of those.  It took months and months of work, it was super boring and mind numbing and it was really hard to justify, and it made Acorn 5 super late.  But we did it anyway, because something in us felt that software quality has been going downhill in general, and we sure as heck weren&#39;t going to let that happen to Acorn.  So we took a long break from adding features and just fixed stuff.</p>\n<p>There&#39;s lots more of course (snapping, crop improvements, soft brushes for clone/burn/etc, shape tool improvements, more blend modes, image meta-data editing, Photoshop brush support, etc).  So <a href=\"http://flyingmeat.com/acorn/\">grab Acorn</a> and start playing with it right now.</p>\n<p>And I&#39;ll go back to answering emails and helping people out.</p>\n",
      "date_published": "2015-08-20T15:36:23.000Z",
      "id": "http://flyingmeat.com/blog/archives/2015/8/so_awesome.html",
      "title": "So Awesome, It's Nuts (Acorn 5 Is Out)",
      "url": "http://flyingmeat.com/blog/archives/2015/8/so_awesome.html"
    },
    {
      "content_html": "<p>Apple&#39;s yearly Mac OS release is coming down the tracks, scheduled to crash into everybody sometime this fall.  One of the great new features of El Capitan is a completely new &quot;modern&quot; version of the Core Image framework.  <a href=\"http://flyingmeat.com/acorn/\">Acorn</a> uses the heck out of this framework, and does some <em>interesting</em> things with it.</p>\n<p>Which is to say that there&#39;s some interesting bugs associated with Acorn and 10.11.</p>\n<p>I&#39;ve spent a good amount of time this summer finding bugs and reporting them to Apple when I can create a reproducible case.  Apple has been good at fixing some of these as well, and I&#39;ve been cleaning up places where Acorn was playing fast and loose with the Core Image in ways it probably shouldn&#39;t have been.</p>\n<p>Acorn 5 shipped with a bunch of these fixes, and <a href=\"http://flyingmeat.com/download/latest/\">Acorn 4.5.6</a> is currently being worked on as well (we didn&#39;t forget about Acorn 4 just because 5 is out the door!).</p>\n<p>So the current status is: there are a couple of known issues (like auto levels crashing), but both Acorn 4.5.6 and Acorn 5.0 are working pretty good on 10.11.  However- if you encounter any bugs with it, we&#39;d love to know about them.  Let us know if you find any: <a href=\"mailto:support@flyingmeat.com\">support@flyingmeat.com</a></p>\n",
      "date_published": "2015-08-21T22:36:01.000Z",
      "id": "http://flyingmeat.com/blog/archives/2015/8/acorn_and_el_cap.html",
      "title": "Acorn, OS X 10.11 El Capitan, and You",
      "url": "http://flyingmeat.com/blog/archives/2015/8/acorn_and_el_cap.html"
    },
    {
      "content_html": "<p>It doesn&#39;t happen very often, but I&#39;m releasing two updates to <a href=\"http://flyingmeat.com/acorn/\">Acorn</a> today: 5.1 as well as 4.5.6.  If you&#39;re running the direct version, you can use the Acorn ▸ Check for Updates… menu item to grab the latest version.  If you&#39;re using the App Store version, you&#39;re going to have to wait a bit for Apple to review and approve it.</p>\n<p><strong>First up- what&#39;s new in Acorn 5.1?</strong><br>Some bug fixes, as well as minor compatibility fixes for OS X 10.11 El Capitan (most of the 10.11 fixes were in Acorn 5.0.1 already).  But there are also some neat new features if you&#39;d like to script Acorn from the command line, as well as Taptic feedback when aligning things to guides or canvas edges (this is available on 10.11+).</p>\n<p>And another slightly big thing- basic SVG support.  This has been a huge request for a number of years, and I&#39;m happy to finally have something started for you in Acorn 5.1.  Acorn doesn&#39;t support all the features that SVG provides (nor should it)- but it does a pretty decent job of getting vector objects and layers out of Acorn in a scalable format that&#39;ll be around for years to come.  Look for more SVG improvements in future releases of Acorn as well.</p>\n<p><strong>And what&#39;s new in Acorn 4.5.6?</strong><br>Compatiblity with OS X 10.11 El Capitan, and other bug fixes.  Acorn 4 is still a great usable app- and we&#39;d like to keep it that way.</p>\n<p>We&#39;ve also submitted Acorn 4.5.6 to the App Store- though it&#39;s been removed from sale.  I&#39;ve never tried updating an app that&#39;s been removed from sale, but hopefully it&#39;ll sail right through review without any problems.</p>\n",
      "date_published": "2015-09-29T21:21:56.000Z",
      "id": "http://flyingmeat.com/blog/archives/2015/9/a_pair_of_acorn_releases_today.html",
      "title": "A Pair of Acorn Releases Today",
      "url": "http://flyingmeat.com/blog/archives/2015/9/a_pair_of_acorn_releases_today.html"
    },
    {
      "content_html": "<p>macOS Sierra is just around the corner, and if you&#39;re running the beta or developer seeds of it you&#39;re of course going to want to know if your favorite application, <a href=\"http://flyingmeat.com/acorn/\">Acorn 5</a>, is compatible with it.</p>\n<p>And it is of course.</p>\n<strike>There is at least one Sierra issue we are aware of (in beta 3, and it&#39;s totally Apple&#39;s fault). Exporting deep images (aka, 16 bits per component) is currently broken in the developer and public betas. I&#39;ve filed a radar with Apple and this is such a serious oversight on their part, that I&#39;m sure it&#39;ll be fixed pretty soon (#27285115 ImageIO problemo).</strike>\n\n<p><strong>Update August 1st, 2016:</strong> Apple has fixed this bug in beta 4, and we are no longer aware of any issues with Acorn and 10.12 Sierra.</p>\n<p>If you&#39;re running the Sierra betas and you encounter any crashes, bugs, or other issues let us <a href=\"mailto:support@flyingmeat.com\">know right away</a>! We want to make sure we don&#39;t miss anything.</p>\n",
      "date_published": "2016-07-22T16:02:14.000Z",
      "id": "http://flyingmeat.com/blog/archives/2016/7/acorn_and_sierra_compatibility.html",
      "title": "Acorn and Sierra Compatibility",
      "url": "http://flyingmeat.com/blog/archives/2016/7/acorn_and_sierra_compatibility.html"
    },
    {
      "content_html": "<p>Earlier today I typed in the magic commands which perform the <a href=\"http://flyingmeat.com/acorn/\">Acorn</a> release song and dance, which means Acorn 5.5 has been released for everyone. It&#39;s available via direct update as well as the Mac App Store, so go grab it when you get a second.</p>\n<p>What&#39;s new and interesting in 5.5? For starters, I&#39;ve rewritten the color picker loupe tool so that it Does The Right Thing (tm) regarding display color profiles and sampling colors from anywhere on the screen. We&#39;ve also given it a few new tricks for zooming in and out when sampling colors as well. It also looks better than the standard system one Acorn used previously.</p>\n<p>We&#39;ve also added new dithering filters, new layer alignment options, and additional information about your image in the Metadata window.</p>\n<p>Changes in Acorn 5.5 include various color profile improvements including reworking how colors are matched to the your image&#39;s profile before they hit the display, as well converting incoming colors from the color picker to the right color space. Cleaning up these seemingly little things really make a difference now that wide gamut displays are showing up everywhere these days.</p>\n<p>And as I always do, I close up bugs that we find along the way. The <a href=\"http://flyingmeat.com/acorn/releasenotes.html\">full release notes are available</a> on our website. And while you&#39;re reading about what&#39;s new, make sure to scroll down and see what else we&#39;ve changed since Acorn 5 was released. We&#39;ve put out 10 updates to Acorn 5 in just under a year with over 100 new things and tweaks, so I won&#39;t fault you if you might have missed one or two.</p>\n<p><a href=\"http://flyingmeat.com/acorn/\">Acorn 5.5</a> is a free update for anyone who has already purchased Acorn 5 and it runs on macOS 10.10 Yosemite, 10.11 El Capitan, and 10.12 Sierra.</p>\n",
      "date_published": "2016-08-02T20:07:06.000Z",
      "id": "http://flyingmeat.com/blog/archives/2016/8/acorn_5.5_is_out.html",
      "title": "Acorn 5.5 is out",
      "url": "http://flyingmeat.com/blog/archives/2016/8/acorn_5.5_is_out.html"
    },
    {
      "content_html": "<p>For years we&#39;ve had people ask for Acorn&#39;s documentation in PDF form, and as a response to that we created the <em>Acorn 5 Basics</em> PDF which you can download from the <a href=\"http://flyingmeat.com/acorn/docs/\">main documentation page</a>. It was only ever a subset of the entire documentation however.</p>\n<p>Ever since the iPad came out, and with it iBooks, we&#39;ve been wanting to turn Acorn&#39;s online documentation into a downloadable ePub. In theory this is pretty easy to do- all of our online documentation is pushed up as HTML, and that&#39;s the native format of ePubs. But ePub readers don&#39;t support the full range of HTML that web browsers do, so there were a ton of little things to clean up and organize.</p>\n<p>Anyway, this is a long way of saying we have the Acorn 5 documentation available as an ePub for you: <a href=\"http://flyingmeat.s3.amazonaws.com/Acorn5.epub\">Acorn 5.epub</a>. You can download all 1100+ pages of Acorn&#39;s documentation and read it in iBooks either on your Macintosh or iOS device.</p>\n<p>It&#39;s pretty awesome. And since this is a first run of it, we&#39;re calling this a beta. We&#39;ll clean up things in future releases of the ePub. And if you find any problems in it, <a href=\"mailto:support@flyingmeat.com\">please let us know</a>.</p>\n",
      "date_published": "2016-08-17T17:38:48.000Z",
      "id": "http://flyingmeat.com/blog/archives/2016/8/an_epub_for_acorn_5.html",
      "title": "An ePub for Acorn 5",
      "url": "http://flyingmeat.com/blog/archives/2016/8/an_epub_for_acorn_5.html"
    },
    {
      "content_html": "<p>Just because we&#39;re still pushing ahead with Acorn 5, doesn&#39;t mean we have forgotten about Acorn 4. We&#39;ve just pushed <a href=\"http://flyingmeat.com/download/Acorn-4.5.8.zip\">Acorn 4.5.8</a>, which contains compatibly fixes for MacOS 10.12 Sierra. Acorn 4.5.8 is now compatible with 10.8 through 10.12.</p>\n<p>This release is currently for direct customers only. For some reason the App Store has Acorn 4.5.7 in some sort of wedged state that we haven&#39;t quire figured out. We&#39;ll see if we can get that resolved sometime soon and get v4.5.8 out there as well.</p>\n",
      "date_published": "2016-11-21T20:35:12.000Z",
      "id": "http://flyingmeat.com/blog/archives/2016/11/acorn_4.5.8_released.html",
      "title": "Acorn 4.5.8 Released",
      "url": "http://flyingmeat.com/blog/archives/2016/11/acorn_4.5.8_released.html"
    },
    {
      "content_html": "<p>Tomorrow, Dec 6th, <a href=\"http://flyingmeat.com/\">Flying Meat</a> will be donating 100% of our sales to the <a href=\"https://www.splcenter.org/\">Southern Poverty Law Center</a>:</p>\n<blockquote>\n<p>&quot;The SPLC is dedicated to fighting hate and bigotry and to seeking justice for the most vulnerable members of our society. Using litigation, education, and other forms of advocacy, the SPLC works toward the day when the ideals of equal justice and equal opportunity will be a reality.&quot;</p>\n</blockquote>\n<p>If you don&#39;t already own <a href=\"http://flyingmeat.com/acorn/\">Acorn</a>, tomorrow would be a good time to pick it up. And if you buy it <a href=\"https://secure.flyingmeat.com/store/\">directly</a> from us instead of the App Store, 30% more of your purchase will be given to the SPLC.</p>\n<!--\n\nTo put it bluntly, we aren't happy with the choices America made in our last election. And I wish we had done more to stop what has happened. What is happening.\n\nSo we're going to start throwing money to those who are in a good position to help. A single donation is not enough and won't change what has happened, but it's something. And it's a start. Because what we can't do is just sit here, doing nothing, thinking good thoughts.\n\n-->",
      "date_published": "2016-12-05T18:27:20.000Z",
      "id": "http://flyingmeat.com/blog/archives/2016/12/the_first_tuesday_after_the_first_monday.html",
      "title": "The First Tuesday After the First Monday",
      "url": "http://flyingmeat.com/blog/archives/2016/12/the_first_tuesday_after_the_first_monday.html"
    },
    {
      "content_html": "<p>Flying Meat has just <a href=\"http://flyingmeat.com/acorn/\">released Acorn 5.6</a>, which is a free update to anyone who already owns Acorn 5.</p>\n<p>What&#39;s new and awesome? The big new feature is Touch Bar support for the MacBook Pro. You can now resize your brushes, flip around your canvas, apply boolean operations and align your selected shapes, and much much more. The Touch Bar gives you intuitive control when editing your images, all with a couple of easy taps on your new MacBook Pro.</p>\n<p>If you don&#39;t have a new MacBook Pro you&#39;re going to like this update anyway because it includes one of our top feature requests: A Photos Extension to edit your images in Acorn. Now with a couple of clicks you can open up your image from Photos, edit in Acorn, then save your image back to Photos. It really is that simple.</p>\n<p>The <a href=\"http://flyingmeat.com/acorn/releasenotes.html\">full release notes</a> are also available.</p>\n",
      "date_published": "2016-12-15T17:53:12.000Z",
      "id": "http://flyingmeat.com/blog/archives/2016/12/acorn_5.6_with_touch_bar_photos_extension_released.html",
      "title": "Acorn 5.6 With Touch Bar Support and a Photos Extension Released",
      "url": "http://flyingmeat.com/blog/archives/2016/12/acorn_5.6_with_touch_bar_photos_extension_released.html"
    },
    {
      "content_html": "<p>Up here at the FM world headquarters, I&#39;ve recently pushed the buttons and typed the commands to make $acorn$ 5.6.4 roll out to all my favorite people.</p>\n<p>It&#39;s purely a bug fix release, but it includes a fix for a 10.12 issue that I&#39;ve spent way too long tracking down. So if you&#39;re on 10.12 Sierra, and you&#39;ve seen the occasional case where a black box would suddenly appear somewhere on your canvas, this release is for you.</p>\n<p>So start your update engines and grab it today.</p>\n<p>And a small request: if love Acorn and you&#39;ve <a href=\"http://flyingmeat.com/acorn/appstore/\">purchased it via the App Store</a>, why not leave it a nice review or give it a handful of stars? When we push out new releases, it resets the previous reviews and ratings in the store which is a huge bummer for us (and it also creates a disincentive for releasing bugfix builds! But that&#39;s a story for another time). We love getting reviews and ratings though, it&#39;s like fuel for future releases.</p>\n",
      "date_published": "2017-03-16T16:16:34.000Z",
      "id": "http://flyingmeat.com/blog/archives/2017/3/acorn_5.6.4_released.html",
      "title": "Acorn 5.6.4 Released",
      "url": "http://flyingmeat.com/blog/archives/2017/3/acorn_5.6.4_released.html"
    }
  ],
  "title": "News from Flying Meat",
  "version": "https://jsonfeed.org/version/1"
}
